{
    "totalArticles": 266666,
    "articles": [
        {
            "title": "99 years of Indraprastha College for Women, 75 years of independence: What does education look like for the next century?",
            "description": "To reduce education to a transactional exchange of knowledge acquired and economic value created is a ticking time-bombing of self-destruction. I would like people in positions of power to look at young India as more than a demographic dividend",
            "content": "One of the best naps I ever had was on a sunny winter morning in the back lawns of Indraprastha College for Women (IPCW), University of Delhi.\nMy backpack tucked behind my head, a last-minute cancelled class and the combination of the low temperature... [4951 chars]",
            "url": "https://indianexpress.com/article/opinion/99-years-indraprastha-college-women-75-years-independence-education-look-like-next-century-8889346/",
            "image": "https://images.indianexpress.com/2023/08/women-DU.jpg",
            "publishedAt": "2023-08-12T09:23:41Z",
            "source": {
                "name": "The Indian Express",
                "url": "https://indianexpress.com"
            }
        },
        {
            "title": "Multi Commodity Exchange of India Limited annonce la démission de Ved Prakash Chaturvedi en tant qu'administrateur non exécutif indépendant/intérêt public",
            "description": "Multi Commodity Exchange of India Limited a annoncé que M. Ved Prakash Chaturvedi, par sa lettre datée du 11 août 2023, a présenté sa démission en tant qu'administrateur non exécutif...\n-Aujourd'hui à 09:15- Zonebourse",
            "content": "Multi Commodity Exchange of India Limited est une bourse de dérivés de matières premières. La société facilite la négociation en ligne de contrats à terme et d'options sur les matières premières, l'abonnement à des flux de données et l'adhésion. Elle... [1005 chars]",
            "url": "https://www.zonebourse.com/cours/action/MULTI-COMMODITY-EXCHANGE-10315042/actualite/Multi-Commodity-Exchange-of-India-Limited-annonce-la-demission-de-Ved-Prakash-Chaturvedi-en-tant-qu-44600249/",
            "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
            "publishedAt": "2023-08-12T07:15:00Z",
            "source": {
                "name": "Zonebourse.com",
                "url": "https://www.zonebourse.com"
            }
        },
        {
            "title": "US Tops Foreign Tourist Arrivals in India for 2022, But Bangladesh May Reclaim Top Spot This Year",
            "description": "The US has emerged as the top contributor of foreign tourists to India for the second year running, with Bangladesh, the United Kingdom, Australia and Canada following respectively in the top five for 2022.",
            "content": "The US has emerged as the top contributor of foreign tourists to India for the second year running, with Bangladesh, the United Kingdom, Australia and Canada following respectively in the top five for 2022.\nA little over 61.19 lakh foreign tourists v... [7074 chars]",
            "url": "https://www.news18.com/india/us-tops-foreign-tourist-arrivals-in-india-for-2022-but-bangladesh-may-reclaim-top-spot-this-year-8533441.html",
            "image": "https://images.news18.com/ibnlive/uploads/2023/08/taj-mahal-169182357916x9.png",
            "publishedAt": "2023-08-12T07:01:02Z",
            "source": {
                "name": "News18",
                "url": "https://www.news18.com"
            }
        },
        {
            "title": "Ingersoll-Rand (India) Limited déclare un dividende pour l'exercice financier se terminant le 31 mars 2023",
            "description": "Ingersoll-Rand Limited a annoncé que lors de son assemblée générale annuelle tenue le 11 mars 2023, les actionnaires ont approuvé la déclaration d'un dividende de 20 INR par action pour...\n-Aujourd'hui à 08:32- Zonebourse",
            "content": "Ingersoll-Rand (India) Limited est une société basée en Inde, dont l'activité principale est la fabrication et la vente de compresseurs d'air industriels de différentes capacités et la fourniture de services connexes. La société vend des compresseurs... [554 chars]",
            "url": "https://www.zonebourse.com/cours/action/INGERSOLL-RAND-INDIA-LI-9743107/actualite/Ingersoll-Rand-India-Limited-declare-un-dividende-pour-l-exercice-financier-se-terminant-le-31-mar-44599488/",
            "image": "https://www.zonebourse.com/images/twitter_ZB_fdnoir.png",
            "publishedAt": "2023-08-12T06:32:00Z",
            "source": {
                "name": "Zonebourse.com",
                "url": "https://www.zonebourse.com"
            }
        },
        {
            "title": "Timken India Limited annonce la fermeture de l'usine de Jamshedpur",
            "description": "Timken India Limited a annoncé que l'usine de Jamshedpur de la société restera fermée du 25 août 2023 au 3 septembre 2023 en raison d'une faible demande et d'une meilleure planification de la...\n-Aujourd'hui à 08:28- Zonebourse",
            "content": "Timken India Limited est engagée dans la fabrication de roulements antifriction, de produits de transmission de puissance mécanique et de services connexes. Les principales activités de la société comprennent la fabrication, la distribution et la ven... [1037 chars]",
            "url": "https://www.zonebourse.com/cours/action/TIMKEN-INDIA-LIMITED-46729444/actualite/Timken-India-Limited-annonce-la-fermeture-de-l-usine-de-Jamshedpur-44600159/",
            "image": "https://www.zonebourse.com/images/twitter_ZB_fdblanc.png",
            "publishedAt": "2023-08-12T06:28:00Z",
            "source": {
                "name": "Zonebourse.com",
                "url": "https://www.zonebourse.com"
            }
        },
        {
            "title": "Return of Rahul Gandhi: Challenges That Lie Ahead For Congress, INDIA Bloc - News18",
            "description": "In the bustling political landscape of the INDIA bloc, it would be an oversimplification to assume that every political party unequivocally endorses Rahul Gandhi's ascension to the central stage",
            "content": "The recent return of Rahul Gandhi, a prominent figure in the Indian political landscape, following the intervention of the Supreme Court, has undoubtedly marked a significant turning point in the realm of politics. As a Member of Parliament, (MP) one... [9294 chars]",
            "url": "https://www.news18.com/opinion/opinion-return-of-rahul-gandhi-challenges-that-lie-ahead-for-congress-india-bloc-8533544.html",
            "image": "https://images.news18.com/ibnlive/uploads/2023/08/rahul-gandhi-parliament-monsoon-session-169137254116x9.jpg",
            "publishedAt": "2023-08-12T06:27:16Z",
            "source": {
                "name": "News18",
                "url": "https://www.news18.com"
            }
        },
        {
            "title": "Indira Gandhi's speech, Ravi Shankar's concert-Master Sound shaped Independent India's voice",
            "description": "The third-generation owner of Master Sound, Tarandeep Singh, attributes the success of the company to his grandfather and father’s dedication to quality despite cost.",
            "content": "This led him to Panchkuian Road. Named after the five Mughal-era wells that provided water to people living in this area, this road was developed by British town planners as the second arterial route that connected Old Delhi to the evolving capital o... [6748 chars]",
            "url": "https://theprint.in/feature/indira-gandhis-speech-ravi-shankars-concert-master-sound-shaped-independent-indias-voice/1711419/",
            "image": "https://static.theprint.in/wp-content/uploads/2023/08/nootan-manmohan-9th-august-1.jpg",
            "publishedAt": "2023-08-12T06:15:39Z",
            "source": {
                "name": "ThePrint",
                "url": "https://theprint.in"
            }
        },
        {
            "title": "'India has zero tolerance policy against corruption': PM Modi in G20 Anti-Corruption Ministerial Meeting",
            "description": "The prime minister also mentioned the enactment of the Economic Offenders Act in 2018 under which the Indian government is aggressively pursuing economic offenders and informed about the recovery of assets worth over 1.8 billion dollars from economic offenders and fugitives",
            "content": "Prime Minister Narendra Modi said that India has a strict policy against corruption during the G20 Anti-Corruption Ministerial Meeting on Saturday.\nThe meeting was held in Kolkata and was attended by PM Modi virtually.\n“India has a strict policy of z... [1995 chars]",
            "url": "https://www.firstpost.com/india/india-has-zero-tolerance-policy-against-corruption-pm-modi-in-g20-anti-corruption-ministerial-meeting-12988902.html",
            "image": "https://images.firstpost.com/wp-content/uploads/2023/07/PM-MODI-640-1.jpg",
            "publishedAt": "2023-08-12T06:13:14Z",
            "source": {
                "name": "Firstpost",
                "url": "https://www.firstpost.com"
            }
        },
        {
            "title": "Expresso Business and Finance News Highlights of the Week on 12 August 2023",
            "description": "In this weekly round-up, we talk about RBI keeping interest rates unchanged in hawkish policy, and Sebi clarifying on 120 untraceable entities. We also talk about Air India's new logo among other important developments.",
            "content": "Let's begin with the news that made headlines this week. The Reserve Bank of India this week left its key interest rates unchanged for a third straight meeting but signalled tighter policy if food prices continue to drive inflation higher. The moneta... [4535 chars]",
            "url": "https://indianexpress.com/audio/expresso-business-update/expresso-business-and-finance-news-highlights-of-the-week-on-12-august-2023/8887257/",
            "image": "https://images.indianexpress.com/2021/09/Expresso-Business-Mobile-4.jpg",
            "publishedAt": "2023-08-12T06:00:35Z",
            "source": {
                "name": "The Indian Express",
                "url": "https://indianexpress.com"
            }
        },
        {
            "title": "Former defence chiefs in Taiwan: How mutual security concerns emanating from China influence New Delhi-Taipei ties",
            "description": "By pursuing a nuanced approach that combines economic cooperation, strategic partnerships, and principled support for democratic values, India can position itself as a responsible regional power while navigating the complexities of its relationship with China",
            "content": "Three former Service Chiefs General Manoj Naravane (Retd), Admiral Karambir Singh (Retd) and Air Chief Marshal RKS Bhadauria (Retd) are visiting Taiwan to speak and participate in a security dialogue at the Ketagalan Forum, a Security event focused o... [12449 chars]",
            "url": "https://www.firstpost.com/opinion/former-defence-chiefs-in-taiwan-how-mutual-security-concerns-emanating-from-china-influence-new-delhi-taipei-ties-12988812.html",
            "image": "https://images.firstpost.com/wp-content/uploads/2023/08/India-Taiwan.jpg",
            "publishedAt": "2023-08-12T05:54:42Z",
            "source": {
                "name": "Firstpost",
                "url": "https://www.firstpost.com"
            }
        }
    ]
}